InformationRegisters/ФайлыОбластейДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ФайлыОбластейДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТомНаДиске</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлCRC32</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьНаДиске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ФайлыОбластейДанныхВнешнийИнтерфейс/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
    
// Возвращает описание данных логического хранилища.
//
// Параметры:
//  ИдентификаторХранилища - Строка - идентификатор логического хранилища.
//  ИдентификаторДанных    - Строка - идентификатор данных хранилища.
// 
// Возвращаемое значение:
//  - Структура - описание данных хранилища.
//      - ИмяФайла - Строка - имя файла.
//      - Размер - Число - размер файла в байтах.
//      - Данные - ДвоичныеДанные, Строка - двоичные данные файла или расположение файла на диске.
//
Функция Описание(ИдентификаторХранилища, ИдентификаторДанных) Экспорт
	
	Результат = Неопределено;
	
	Если ИдентификаторХранилища = ИдентификаторХранилища() Тогда
        Результат = РегистрыСведений.ФайлыОбластейДанных.ОписаниеФайла(ИдентификаторДанных);
        Результат.Вставить("ИмяФайла", Результат.Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Возвращает данные логического хранилища.
//  
// Параметры:
//  ОписаниеДанных - Структура - описание данных хранилища.
//  
// Возвращаемое значение:
//  - ДвоичныеДанные, Строка - двоичные данные файла или расположение файла на диске.
//
Функция Данные(ОписаниеДанных) Экспорт
    
    Если ЗначениеЗаполнено(ОписаниеДанных.ПолноеИмя) Тогда
        Возврат ОписаниеДанных.ПолноеИмя;
    Иначе
        Возврат ОписаниеДанных.Данные;
    КонецЕсли; 
	
КонецФункции

// Записывает данные в логическое хранилище.
// 
// Параметры:
//  Структура - описание данных хранилища.
//    - ИмяФайла - Строка - имя файла.
//    - Размер - Число - размер файла в байтах.
//    - Данные - ДвоичныеДанные, Строка - двоичные данные файла или расположение файла на диске.
// 
// Возвращаемое значение:
//   - Строка - идентификатор данных хранилища.
//   
Функция Загрузить(ОписаниеДанных) Экспорт
    
    Если ТипЗнч(ОписаниеДанных.Данные) = Тип("ДвоичныеДанные") Тогда
        Идентификатор = РегистрыСведений.ФайлыОбластейДанных.Загрузить(ОписаниеДанных.ИмяФайла, ОписаниеДанных.Данные);
    Иначе
        Идентификатор = РегистрыСведений.ФайлыОбластейДанных.Загрузить(ОписаниеДанных.ИмяФайла,, ОписаниеДанных.Данные);
    КонецЕсли; 
    
	Возврат Строка(Идентификатор);
	
КонецФункции

// Возвращает идентификатор хранилища в виде строки.
// 
// Возвращаемое значение:
//   - Строка - идентификатор хранилища. 
//
Функция ИдентификаторХранилища() Экспорт
	
	Возврат "files";
	
КонецФункции

// Обработчик регламентного задания "УдалениеВременныхФайловОбластейДанных".
//
Процедура УдалениеВременныхФайловОбластейДанных() Экспорт
    
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
        Метаданные.РегламентныеЗадания.УдалениеВременныхФайловОбластейДанных);
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ
        |   ФайлыОбластейДанных.Идентификатор КАК Идентификатор
        |ИЗ
        |   РегистрСведений.ФайлыОбластейДанных КАК ФайлыОбластейДанных
        |ГДЕ
        |   ФайлыОбластейДанных.Временный
        |   И ФайлыОбластейДанных.ДатаФайла < &ГраницаХранения";
    Запрос.УстановитьПараметр("ГраницаХранения", ТекущаяУниверсальнаяДата() - 86400); // Сутки
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        РегистрыСведений.ФайлыОбластейДанных.Удалить(Выборка.Идентификатор);
    КонецЦикла;
     
КонецПроцедуры

#КонецОбласти
